{
  "backend/main.mo": "Defines actor with user, booking, tailor, and address types plus maps for persistent storage and authorization-protected profile and booking queries and mutations.",
  "feature_evidence.json": "Lists feature‑to‑file mappings, related components, and confidence levels for implemented app features including auth, bookings, and dashboards.",
  "frontend-file-summaries.txt": "Contains prewritten one‑sentence summaries for major frontend files including hooks, pages, components, and configuration.",
  "frontend/index.css": "Tailwind base file defining global OKLCH color variables and light/dark theme tokens with shared border and background styles.",
  "frontend/index.html": "Basic HTML shell that mounts the React app and loads main.tsx as the entry script.",
  "frontend/src/App.tsx": "Main app component implementing hash‑based routing, authentication checks, role‑based access control, and conditional rendering of core pages.",
  "frontend/src/components/addresses/SavedAddressPicker.tsx": "Dialog component for listing, selecting, adding, and deleting saved addresses using React Query mutations and toast feedback.",
  "frontend/src/components/admin/AdminBookingsPanel.tsx": "Displays and manages bookings, including filtering, assigning tailors, and setting estimated prices.",
  "frontend/src/components/admin/AdminTailorsPanel.tsx": "Lists tailors and allows admins to activate or deactivate their profiles.",
  "frontend/src/components/admin/AdminUsersPanel.tsx": "Shows all registered users with their profile details and principal IDs.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Renders an access‑denied message with a button redirecting to the home page.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout and updates query state accordingly.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for new users to enter name and choose a role before saving their profile.",
  "frontend/src/components/bookings/BookingStatusActions.tsx": "Provides UI for selecting and confirming valid booking status transitions.",
  "frontend/src/components/bookings/BookingStatusTimeline.tsx": "Displays a chronological log of booking status changes with timestamps.",
  "frontend/src/components/layout/Header.tsx": "Renders a responsive header with role‑based navigation links and login controls.",
  "frontend/src/components/payments/PaymentSection.tsx": "Displays booking payment info, allows admins to set price, and updates payment status via mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useCurrentUser.ts": "Fetches the current user's profile and admin status using the actor, handling loading and identity state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, logout, and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, bookings, and related backend data.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom color variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders the admin dashboard with stats and tabs for managing bookings, tailors, and users.",
  "frontend/src/pages/booking/BookingDetailsPage.tsx": "Displays detailed booking info with status, history, tailor data, and actions for customers, tailors, and admins.",
  "frontend/src/pages/customer/CustomerBookingsPage.tsx": "Shows a customer's bookings and provides a form to create new tailoring appointments.",
  "frontend/src/pages/marketing/LandingSection.tsx": "Marketing landing section with hero content, features, and a call‑to‑action for customers and tailors.",
  "frontend/src/pages/tailor/TailorDashboardPage.tsx": "Tailor dashboard for managing profiles and handling incoming and active booking requests.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session‑based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration with theme extensions, colors, typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, architectural notes, image requirements, and a list of implemented features for the StichMe tailoring app. It outlines backend/frontend expectations and tracks feature versions and requirements."
}